# GetActiveEditItem

## Description
Returns the active edit control in the specified dialog.  If no edit control has the focus, -1 is returned.

```pascal
FUNCTION GetActiveEditItem(dialogID : LONGINT) : LONGINT;
```

```python

def vs.GetActiveEditItem(dialogID):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT||

## Version
Availability: from VectorWorks12.0.1
## Category
* Dialogs - Modern